## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 7 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            RESOURCE                             |
|--------|-----------------------------------------------------------------|
| add    | `aws_kms_key.cloudwatch_alerts_us_east_1`                       |
|        | `aws_sns_topic.cloudwatch_alert_ok_us_east_1`                   |
|        | `aws_sns_topic.cloudwatch_alert_warning_us_east_1`              |
|        | `aws_sns_topic_policy.cloudwatch_alert_ok_us_east_1`            |
|        | `aws_sns_topic_policy.cloudwatch_alert_warning_us_east_1`       |
|        | `aws_sns_topic_subscription.cloudwatch_alert_ok_us_east_1`      |
|        | `aws_sns_topic_subscription.cloudwatch_alert_warning_us_east_1` |
| update | `aws_kms_key.cloudwatch_alerts`                                 |
|        | `module.celery_beat_ecs.aws_ecs_service.this`                   |
|        | `module.celery_worker_ecs.aws_ecs_service.this`                 |
|        | `module.superset_ecs.aws_ecs_service.this`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_kms_key.cloudwatch_alerts will be updated in-place
  ~ resource "aws_kms_key" "cloudwatch_alerts" {
        id                                 = "24fa4d4e-863f-4cd3-9382-2dab090e7a0a"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::066023111852:root"
                        }
                        Resource  = "*"
                        Sid       = "Enable IAM User Permissions"
                    },
                  ~ {
                      ~ Principal = {
                          ~ Service = "logs.ca-central-1.amazonaws.com" -> [
                              + "logs.us-east-1.amazonaws.com",
                              + "logs.ca-central-1.amazonaws.com",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:GenerateDataKey*",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            Service = "cloudwatch.amazonaws.com"
                        }
                        Resource  = "*"
                        Sid       = "Allow_CloudWatch_for_CMK"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # aws_kms_key.cloudwatch_alerts_us_east_1 will be created
  + resource "aws_kms_key" "cloudwatch_alerts_us_east_1" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "SNS topic for CloudWatch alarm alerts"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::066023111852:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "logs.us-east-1.amazonaws.com",
                              + "logs.ca-central-1.amazonaws.com",
                            ]
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow_CloudWatch_for_CMK"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "CloudwatchEvents"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic.cloudwatch_alert_ok_us_east_1 will be created
  + resource "aws_sns_topic" "cloudwatch_alert_ok_us_east_1" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "cloudwatch-alert-ok"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic.cloudwatch_alert_warning_us_east_1 will be created
  + resource "aws_sns_topic" "cloudwatch_alert_warning_us_east_1" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "cloudwatch-alert-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.cloudwatch_alert_ok_us_east_1 will be created
  + resource "aws_sns_topic_policy" "cloudwatch_alert_ok_us_east_1" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:Subscribe",
                          + "SNS:SetTopicAttributes",
                          + "SNS:RemovePermission",
                          + "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "066023111852"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Default_Policy"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_sns_topic_policy.cloudwatch_alert_warning_us_east_1 will be created
  + resource "aws_sns_topic_policy" "cloudwatch_alert_warning_us_east_1" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:Subscribe",
                          + "SNS:SetTopicAttributes",
                          + "SNS:RemovePermission",
                          + "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "066023111852"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Default_Policy"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_sns_topic_subscription.cloudwatch_alert_ok_us_east_1 will be created
  + resource "aws_sns_topic_subscription" "cloudwatch_alert_ok_us_east_1" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.cloudwatch_alert_warning_us_east_1 will be created
  + resource "aws_sns_topic_subscription" "cloudwatch_alert_warning_us_east_1" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-beat"
        name                               = "celery-beat"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:97" -> "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:75"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-worker"
        name                               = "celery-worker"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:100" -> "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:77"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
      ~ propagate_tags                     = "NONE" -> "SERVICE"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:116" -> "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:93"
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 7 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
